Repository: NaturalHistoryMuseum/scratchpads2
Catalog: sites/all/modules/contrib/date/translations/date_api.*.po
Languages: he

source: remove
he: הסר

source: No custom formats configured. Please <a href="@link">add</a> some.
he: לא הוגדרו תסדירים מותאמים אישית של תאריך. אנא <a href="@link">הוסף</a> כמה.

source: Format string
he: תסדיר מחרוזת

source: A user-defined date format. See the <a href="@url">PHP manual</a> for available options. This format is currently set to display as <span>%date</span>.
he: תסדיר תאריך מותאם אישית. אנא פנה <a href="@url">למדריך של PHP</a> לאפשרויות הזמינות. התסדיר כרגע מוגדר להציג בתור <span>%date</span>.

source: Save configuration
he: שמור תצורה

source: Date formats
he: תסדירי תאריך

source: Are you sure you want to remove the format %format?
he: האם אתה בטוח כי ברצונך להסיר את התסדיר %format?

source: This action cannot be undone.
he: אין אפשרות לבטל את הפעולה הנ"ל.

source: Remove
he: הסר

source: Removed date format %format.
he: תבנית תאריך %format הוסרה.

source: Are you sure you want to remove the format type %format?
he: האם אתה בטוח כי ברצונך להסיר את התסדיר %format?

source: Removed date format type %format.
he: תסדיר התאריך %format הוסר.

source: !type date format
he: תסדיר תאריך !type

source: The year must be a number between %min and %max.
he: התאריך חייב להיות מספר בין %min לבין %max.

source: The month must be a number between 1 and 12.
he: החודש חייב להיות מספר בין 1 ובין 12.

source: The day must be a number between !min and !max.
he: היום חייב להיות מספר בין %min לבין %max.

source: The hour must be a number between !min and !max.
he: השעה חייבת להיות מספר בין %min לבין %max.

source: The minute must be a number between !min and !max.
he: הדקה חייבת להיות מספר בין %min לבין %max.

source: The second must be a number between !min and !max.
he: השנייה חייבת להיות מספר בין %min לבין %max.

source: A valid value is required.
he: נדרש ערך תקין.

source: Field %field has errors.
he: השדה %field מכיל שגיאות.

source: A valid date is required for %title.
he: נדרש תאריך תקין עבור %title.

source: %title is invalid.
he: %title לא תקין.

source: HTTP Request Error importing %filename: @error
he: שגיאת HTTP בעת ייבור של הקובץ %filename, השגיאה היא: @error

source: Failed to open file: %filename
he: אין אפשרות לפתוח את הקובץ: %filename

source: Invalid calendar file: %filename
he: קובץ calendar לא תקין: %filename

source: Invalid calendar file.
he: קובץ calendar לא תקין.

source: Long
he: ארוך

source: Medium
he: מדיה

source: Short
he: קצר

source: !day-name Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday
he: !day-name ראשון|שני|שלישי|רביעי|חמישי|שישי|שבת

source: !day-abbreviation Sun|Mon|Tue|Wed|Thu|Fri|Sat
he: !day-abbreviation יום א'| יום ב'|יום ג'|יום ד'|יום ה'|יום ו'|שבת

source: !day-abbreviation S|M|T|W|T|F|S
he: !day-abbreviation א|ב|ג|ד|ה|ו|ש

source: !day-abbreviation SU|MO|TU|WE|TH|FR|SA
he: !day-abbreviation א|ב|ג|ד|ה|ו|ש

source: !datetime Year|Month|Day|Week|Hour|Minute|Second|All Day|All day
he: !datetime שנה|חודש|יום|שבוע|שעה|דקה|שנייה|כל היום|כל היום

source: !datetime_plural Years|Months|Days|Weeks|Hours|Minutes|Seconds
he: !datetime_plural שנים|חודשים|ימים|שבועות|שעות|דקות|שניות

source: !date_order Every|First|Second|Third|Fourth|Fifth
he: !date_order כל|ראשון|שני|שלישי|רביעי|חמישי

source: !date_order |Last|Next to last|Third from last|Fourth from last|Fifth from last
he: !date_order |אחרון|לפני אחרון|שלישי מהסוף|רביעי מהסוף|חמישי מהסוף

source: !date_nav Prev|Next|Today
he: !date_nav הקודם|הבא|היום

source: !month-name |January|February|March|April|May|June|July|August|September|October|November|December
he: !month-name |ינואר|פברואר|מרץ|אפריל|מאי|יוני|יולי|אוגוסט|ספטמבר|אוקטובר|נובמבר|דצמבר

source: !month-abbreviation |Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec
he: !month-abbreviation |ינ'|פב'|מר'|אפ'|מאי|ינ'|יו'|אג'|ספ'|או'|נוב'|דצ'

source: !time ago
he: לפני !time

source: Formats
he: תסדירים

source: Allow users to configure date formats
he: אפשר למשתמשים להגדיר את תסדירי התאריך

source: Configure
he: הגדרה

source: Date and time lookup
he: חיפוש תאריך ושעה

source: Custom formats
he: תסדירים מותאמים אישית

source: Allow users to configure custom date formats.
he: אפשר למשתמשים להגדיר תסדירים מותאמים אישית

source: Add format
he: הוסף תסדיר

source: Allow users to add additional date formats.
he: אפשר למשתמשים להוסיף תסדיר תאריך חדשים.

source: Delete date format
he: מחק תסדיר תאריך

source: Allow users to delete a configured date format.
he: אפשר למשתמשים להסיר תסדירי תאריך מוגדרים.

source: Delete date format type
he: מחק תסדיר סוג של תאריך

source: Allow users to delete a configured date format type.
he: אפשר למשתמשים למחוק תסדיר תאריך מוגדר.

source: Per-user timezone name.
he: שם איזור זמן עבור כל משתמש.

source: date module cannot be updated until after Views has been updated. Please return to <a href="@update-php">update.php</a> and run the remaining updates.
he: אין אפשרות לעדכן את המודול date עד שהמודול Views מעודכן. אנא חזור אל <a href="@update-php">update.php</a> והפעל את העדכונים הנותרים.

source: date.module has updates, but cannot be updated until views.module is updated first.
he: המודול date.module יש לו עדכונים, אך אין אפשרות לעדכן אותו עד ש־views.module מעודכן.

source: The Date API module requires the <a href="@link">Date PHP4 module</a> for PHP versions less than 5.2.
he: המודול Date API דורש את <a href="@link">המודול Date PHP4</a> עבור PHP מגרסה שקטנה מ־5.2.

source: Date API requirements
he: דרישות של Date API

source: A Date API that can be used by other modules.
he: ממשק תכנותי של תאריכים (Date API) עבור מודולים אחרים.

source: Date/Time
he: תאריך/שעה
